---
title: PointCloudColorSettings
classe: Autodesk.Revit.DB.PointClouds.PointCloudColorSettings
namespace: Autodesk.Revit.DB.PointClouds
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# PointCloudColorSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Color Color1 { get; }` | `pointCloudColorSettings.Color1` | Color |
| `Color Color2 { get; }` | `pointCloudColorSettings.Color2` | Color |
| `Boolean IsValidObject { get; }` | `pointCloudColorSettings.IsValidObject` | Boolean |
| `Void Assign(PointCloudColorSettings)` | `pointCloudColorSettings.Assign(other)` | Void |
| `Void Dispose()` | `pointCloudColorSettings.Dispose()` | Void |
| `Boolean IsEqual(PointCloudColorSettings)` | `pointCloudColorSettings.IsEqual(other)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```